## Pandas 학습

1. 데이터 분석을 위한 모듈
2. excel과 가장 큰 차이점 : Pandas는 대용량 데이터 처리가 가능
3. 분석 및 데이터 가공에 절대적으로 사용되는 library
4. 주요 학습 내용
>1. DataFrame - excel의 다수의 컬럼들을 보유한 table과 동일하다 간주
>2. series - DataFrame을 구성하는 column 간주

In [28]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.1.3'

In [4]:
s = pd.Series([1, 2, 3])
print(s)
print(type(s))

0    1
1    2
2    3
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
print(s.values)  # series 데이터들만 list
print("-"*10)
print(s.index)   # series의 index 정보 확인
print("-"*10)
print(s.value_counts)   #

[1 2 3]
----------
RangeIndex(start=0, stop=3, step=1)
----------
<bound method IndexOpsMixin.value_counts of 0    1
1    2
2    3
dtype: int64>

In [12]:
# python에서 nn/nan등은 결측치 의미
# 결측치를 제외한 유효한 데이터값들의 개수 반환
s = pd.Series([3, 1, 2, 3, 4, np.nan])
print(s)
print("-"*10)
s.value_counts()

0    3.0
1    1.0
2    2.0
3    3.0
4    4.0
5    NaN
dtype: float64
----------

3.0    2
4.0    1
2.0    1
1.0    1
dtype: int64

In [13]:
s= pd.Series([3, 1, 2, 3, 3, np.nan])
s.value_counts()

3.0    3
2.0    1
1.0    1
dtype: int64

In [14]:
s= pd.Series(['a', 'b', 'a', np.nan])
s.value_counts()

a    2
b    1
dtype: int64

In [16]:
# NaN에 해당하는 결측치로 유효하게 counting
s= pd.Series(['a', 'b', 'a', np.nan])
s.value_counts(dropna=False)

a      2
b      1
NaN    1
dtype: int64

In [18]:
# 정수 타입의 데이터를 실수 타입으로 설정
s= pd.Series([1, 2], dtype='float64')
print(s)

0    1.0
1    2.0
dtype: float64

In [21]:
# 데이터 자체에서 결측치 제거
s = pd.Series(['a','b', np.nan])
print(s)
print(10*'-')
print(s.dropna())  # NaN값이 제거된 새로운 Series 추가 생성(복제본) 단 s 원본은 유지
print(10*'-')
print(s)

0      a
1      b
2    NaN
dtype: object
----------
0    a
1    b
dtype: object
----------
0      a
1      b
2    NaN
dtype: object

## 특정 날짜를 기준으로 DataFrame 생성해보기

In [25]:
datas = pd.date_range('20210310', periods=5)
print(datas)

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14'],
              dtype='datetime64[ns]', freq='D')

In [30]:
np.random.randint(10)

1

In [50]:
np.random.rand()

0.13124208503395396

In [74]:
# 0~1 사이의 균일본포값 반환하는 난수 발생 API
# 6행 4열 구성

df = pd.DataFrame(np.random.rand(6,4))

In [73]:
df

          0         1         2         3
0  0.437811  0.953600  0.997817  0.806224
1  0.903064  0.769209  0.868384  0.702290
2  0.309161  0.852052  0.959946  0.798532
3  0.433691  0.539464  0.880761  0.494684
4  0.827536  0.236205  0.303059  0.882926
5  0.896234  0.263988  0.854853  0.009176

In [75]:
datas = pd.date_range('20210310', periods=12)
print(datas)

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21'],
              dtype='datetime64[ns]', freq='D')

In [77]:
datas[0]

Timestamp('2021-03-10 00:00:00', freq='D')

In [78]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [81]:
# 0~1까지의 균일 분포값을 12x4 즉 48개 구성 후에 이미 존재하는 DatetimeIndex를  index로 적용해서 가공된 DataFrame
df = pd.DataFrame(np.random.rand(12, 4), index=datas)
df

                   0         1         2         3
2021-03-10  0.899980  0.464563  0.861743  0.046202
2021-03-11  0.824941  0.002416  0.130667  0.636186
2021-03-12  0.736324  0.118350  0.671591  0.538938
2021-03-13  0.837555  0.719452  0.240996  0.481877
2021-03-14  0.356618  0.336288  0.576527  0.126033
2021-03-15  0.716233  0.426041  0.821233  0.547799
2021-03-16  0.566151  0.663625  0.882110  0.097840
2021-03-17  0.436301  0.683970  0.169268  0.316772
2021-03-18  0.581124  0.857651  0.726318  0.361577
2021-03-19  0.244249  0.448172  0.498594  0.685626
2021-03-20  0.127549  0.439447  0.772053  0.641754
2021-03-21  0.295324  0.107224  0.972375  0.719897

In [82]:
type(df)

pandas.core.frame.DataFrame

In [84]:
# DataFrame의 컬럼값 수정
df = pd.DataFrame(np.random.rand(12, 4), index=datas, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2021-03-10  0.006601  0.644184  0.532672  0.467867
2021-03-11  0.312817  0.756974  0.957716  0.236238
2021-03-12  0.897959  0.375720  0.368617  0.232783
2021-03-13  0.016771  0.314043  0.408470  0.110425
2021-03-14  0.941564  0.734646  0.677561  0.530078
2021-03-15  0.603685  0.656165  0.875058  0.575381
2021-03-16  0.124827  0.340380  0.686156  0.272611
2021-03-17  0.232311  0.809072  0.335010  0.461453
2021-03-18  0.825263  0.005630  0.516337  0.989873
2021-03-19  0.704615  0.440442  0.520005  0.098968
2021-03-20  0.606863  0.592087  0.963188  0.908297
2021-03-21  0.410020  0.957983  0.469903  0.810637

In [85]:
# DataFrame이 보유한 values값들만 반환
df.values

array([[0.00660119, 0.64418363, 0.5326715 , 0.46786685],
       [0.31281654, 0.75697396, 0.95771611, 0.2362384 ],
       [0.89795923, 0.37572011, 0.36861722, 0.23278326],
       [0.01677115, 0.31404264, 0.40846982, 0.11042486],
       [0.94156436, 0.73464563, 0.67756081, 0.53007841],
       [0.60368528, 0.65616485, 0.87505786, 0.5753811 ],
       [0.12482711, 0.34038035, 0.68615636, 0.27261132],
       [0.23231052, 0.80907223, 0.33500958, 0.46145304],
       [0.82526313, 0.00562962, 0.51633691, 0.98987316],
       [0.70461458, 0.44044202, 0.52000537, 0.09896822],
       [0.60686334, 0.59208663, 0.96318795, 0.90829675],
       [0.41001984, 0.95798296, 0.46990272, 0.81063724]])

In [86]:
df.index

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21'],
              dtype='datetime64[ns]', freq='D')

In [87]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2021-03-10 to 2021-03-21
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     float64
 1   B       12 non-null     float64
 2   C       12 non-null     float64
 3   D       12 non-null     float64
dtypes: float64(4)
memory usage: 480.0 bytes

In [105]:
#? 12x4 구조로 난수 발생된 정수값들로 DataFrame 생성 해 보기
df = pd.DataFrame(np.random.randint(199, size=(12, 4)), index=datas, columns=['A', 'B', 'C', 'D'])
df

              A    B    C    D
2021-03-10  123  129    4   10
2021-03-11  132  102  166   64
2021-03-12  192  145  187   26
2021-03-13   62   50  112   18
2021-03-14   68  171  109  171
2021-03-15  154  103   99  182
2021-03-16  158  192   67    8
2021-03-17  127  112   27  192
2021-03-18  186  157    3  182
2021-03-19  198  187  143   28
2021-03-20   57   19  119   77
2021-03-21   95   73  182  112

In [110]:
df1 = pd.DataFrame(np.random.randint(0,48,(12,4)),  index=datas, columns=['A', 'B', 'C', 'D'])
df1
s1 = pd.Series([np.random.randint(1, 49) for i in range(48)])
df = pd.concat([s1], axis=1)
print(df)

     0
0   12
1   17
2   23
3   46
4   39
5   28
6   34
7    4
8   27
9   13
10  37
11  43
12  35
13  43
14  18
15  42
16  27
17   7
18  45
19   8
20  19
21  35
22  46
23  33
24  21
25  17
26  32
27   7
28  18
29   8
30   4
31  32
32  28
33  47
34  16
35  34
36   2
37  12
38   6
39   4
40  13
41  13
42  34
43  35
44  10
45  33
46  47
47  14

In [113]:
# DataFrame의 기초 통계 자료 확인
df1.describe()

               A          B          C          D
count  12.000000  12.000000  12.000000  12.000000
mean   23.250000  23.833333  19.750000  17.666667
std    14.784052  11.304330  10.515141  11.260012
min     1.000000   7.000000   0.000000   1.000000
25%    11.500000  16.500000  13.500000   9.750000
50%    24.500000  25.500000  18.500000  17.000000
75%    34.500000  33.250000  25.250000  25.000000
max    46.000000  41.000000  39.000000  38.000000

In [116]:
s1 = pd.Series([np.random.randint(1,49) for i in range(48)])
print(type(s1))
print(s1)

<class 'pandas.core.series.Series'>
0     44
1     21
2     37
3      9
4     14
5     11
6     18
7     33
8      2
9     31
10    32
11    17
12    40
13    17
14    16
15    32
16    45
17    32
18    21
19    26
20    36
21    39
22    25
23    34
24    36
25    24
26    34
27    44
28    44
29    34
30    34
31    41
32    15
33     8
34    32
35    40
36    27
37    28
38    33
39    44
40    37
41    23
42    29
43    16
44    48
45    43
46    13
47     3
dtype: int64

In [124]:
df = pd.concat([s1])
print(df)
print(type(df))

0     44
1     21
2     37
3      9
4     14
5     11
6     18
7     33
8      2
9     31
10    32
11    17
12    40
13    17
14    16
15    32
16    45
17    32
18    21
19    26
20    36
21    39
22    25
23    34
24    36
25    24
26    34
27    44
28    44
29    34
30    34
31    41
32    15
33     8
34    32
35    40
36    27
37    28
38    33
39    44
40    37
41    23
42    29
43    16
44    48
45    43
46    13
47     3
dtype: int64
<class 'pandas.core.series.Series'>

In [127]:
# axis=0 : Series, axis=1 : DataFrame, axis 생략 : Series
df = pd.concat([s1], axis=1)
print(df)
print(type(df))

     0
0   44
1   21
2   37
3    9
4   14
5   11
6   18
7   33
8    2
9   31
10  32
11  17
12  40
13  17
14  16
15  32
16  45
17  32
18  21
19  26
20  36
21  39
22  25
23  34
24  36
25  24
26  34
27  44
28  44
29  34
30  34
31  41
32  15
33   8
34  32
35  40
36  27
37  28
38  33
39  44
40  37
41  23
42  29
43  16
44  48
45  43
46  13
47   3
<class 'pandas.core.frame.DataFrame'>

In [130]:
# 오름차순 ascending=True / 내림차순 ascending=False
df1.sort_values(by='B', ascending=True)

             A   B   C   D
2021-03-17  13   7  22  18
2021-03-18  36   8   0  38
2021-03-12  31  12  25  15
2021-03-11   7  18  19  10
2021-03-15  25  18  34   3
2021-03-10  24  22  11   9
2021-03-14   6  29  14  19
2021-03-21  41  29  18  16
2021-03-20  46  33  17  25
2021-03-13   1  34  12  33
2021-03-16  15  35  26  25
2021-03-19  34  41  39   1

In [131]:
# 특정 series만 검색
print(df1.A)
print(df1['A'])

2021-03-10    24
2021-03-11     7
2021-03-12    31
2021-03-13     1
2021-03-14     6
2021-03-15    25
2021-03-16    15
2021-03-17    13
2021-03-18    36
2021-03-19    34
2021-03-20    46
2021-03-21    41
Freq: D, Name: A, dtype: int32
2021-03-10    24
2021-03-11     7
2021-03-12    31
2021-03-13     1
2021-03-14     6
2021-03-15    25
2021-03-16    15
2021-03-17    13
2021-03-18    36
2021-03-19    34
2021-03-20    46
2021-03-21    41
Freq: D, Name: A, dtype: int32

In [136]:
# 특정 series들 검색
df1[['A', 'B']]

             A   B
2021-03-10  24  22
2021-03-11   7  18
2021-03-12  31  12
2021-03-13   1  34
2021-03-14   6  29
2021-03-15  25  18
2021-03-16  15  35
2021-03-17  13   7
2021-03-18  36   8
2021-03-19  34  41
2021-03-20  46  33
2021-03-21  41  29

In [135]:
#행을 구분해서 검색
#index명과 : 표기로 범위 선정해서 검색
df1['2021-03-10' : '2021-03-15']

             A   B   C   D
2021-03-10  24  22  11   9
2021-03-11   7  18  19  10
2021-03-12  31  12  25  15
2021-03-13   1  34  12  33
2021-03-14   6  29  14  19
2021-03-15  25  18  34   3

In [139]:
# index값으로 DataFrame slice
# [시작 : 끝-1]
df1[0: 4]

             A   B   C   D
2021-03-10  24  22  11   9
2021-03-11   7  18  19  10
2021-03-12  31  12  25  15
2021-03-13   1  34  12  33

## loc속성
1. 데이터를 slicing 하는 기술
2. loc[index, columns]
3. : 로만 구성하는 표기는 모든것들 의미

In [141]:
# 모든 row의 A와 B Series 만 slicing
df1.loc[:, ['A', 'B']]

             A   B
2021-03-10  24  22
2021-03-11   7  18
2021-03-12  31  12
2021-03-13   1  34
2021-03-14   6  29
2021-03-15  25  18
2021-03-16  15  35
2021-03-17  13   7
2021-03-18  36   8
2021-03-19  34  41
2021-03-20  46  33
2021-03-21  41  29

In [144]:
# index로는 slicing 불가, index명으로 slcing

df1.loc[['2021-03-10', '2021-03-11'], :]

             A   B   C   D
2021-03-10  24  22  11   9
2021-03-11   7  18  19  10

In [142]:
df1.loc[:, :]

             A   B   C   D
2021-03-10  24  22  11   9
2021-03-11   7  18  19  10
2021-03-12  31  12  25  15
2021-03-13   1  34  12  33
2021-03-14   6  29  14  19
2021-03-15  25  18  34   3
2021-03-16  15  35  26  25
2021-03-17  13   7  22  18
2021-03-18  36   8   0  38
2021-03-19  34  41  39   1
2021-03-20  46  33  17  25
2021-03-21  41  29  18  16

In [146]:
# 0번째, 2번째의 row와 columns 0번째, 2번째 slicing
df1.iloc[[0, 2],[0, 2] ]

             A   C
2021-03-10  24  11
2021-03-12  31  25

In [149]:
# 원본의 해당 위치의 데이터값 100으로 변경
df1.iloc[0, [0,2]] = 100
df1

              A   B    C   D
2021-03-10  100  22  100   9
2021-03-11    7  18   19  10
2021-03-12   31  12   25  15
2021-03-13    1  34   12  33
2021-03-14    6  29   14  19
2021-03-15   25  18   34   3
2021-03-16   15  35   26  25
2021-03-17   13   7   22  18
2021-03-18   36   8    0  38
2021-03-19   34  41   39   1
2021-03-20   46  33   17  25
2021-03-21   41  29   18  16

In [151]:
df2 = df1.copy()
df2

              A   B    C   D
2021-03-10  100  22  100   9
2021-03-11    7  18   19  10
2021-03-12   31  12   25  15
2021-03-13    1  34   12  33
2021-03-14    6  29   14  19
2021-03-15   25  18   34   3
2021-03-16   15  35   26  25
2021-03-17   13   7   22  18
2021-03-18   36   8    0  38
2021-03-19   34  41   39   1
2021-03-20   46  33   17  25
2021-03-21   41  29   18  16

In [208]:
df = pd.DataFrame(np.random.randn(6, 4),  columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -2.097587  0.327855  0.731306  0.396911
1  0.815759 -0.455035 -1.045917 -0.052317
2 -1.869786  0.901711  1.138790  0.909261
3  0.219533 -1.524360 -0.241029 -0.504755
4  1.980305 -0.831352 -0.080027  0.547338
5  0.584580  0.937914 -0.349093  1.212873

In [209]:
# 새로운 컬럼(series) 추가 및 혹여 이미 존재하는 series였을 경우 데이터 갱신
df['E'] = [11, 2, 3, 4, 5, 6]
df

          A         B         C         D   E
0 -2.097587  0.327855  0.731306  0.396911  11
1  0.815759 -0.455035 -1.045917 -0.052317   2
2 -1.869786  0.901711  1.138790  0.909261   3
3  0.219533 -1.524360 -0.241029 -0.504755   4
4  1.980305 -0.831352 -0.080027  0.547338   5
5  0.584580  0.937914 -0.349093  1.212873   6

In [210]:
# 존재하는 series 삭제
del df['E']
df

          A         B         C         D
0 -2.097587  0.327855  0.731306  0.396911
1  0.815759 -0.455035 -1.045917 -0.052317
2 -1.869786  0.901711  1.138790  0.909261
3  0.219533 -1.524360 -0.241029 -0.504755
4  1.980305 -0.831352 -0.080027  0.547338
5  0.584580  0.937914 -0.349093  1.212873

In [211]:
# 

df['E'] = [1, 2, 3, np.nan, 5, 6]
df

          A         B         C         D    E
0 -2.097587  0.327855  0.731306  0.396911  1.0
1  0.815759 -0.455035 -1.045917 -0.052317  2.0
2 -1.869786  0.901711  1.138790  0.909261  3.0
3  0.219533 -1.524360 -0.241029 -0.504755  NaN
4  1.980305 -0.831352 -0.080027  0.547338  5.0
5  0.584580  0.937914 -0.349093  1.212873  6.0

In [212]:
# 해당 series에 데이터 존재 여부 확인 - isin
df['E'].isin([1, 2])

0     True
1     True
2    False
3    False
4    False
5    False
Name: E, dtype: bool

In [213]:
# 데이터 손실 발생 -> 기존 DataFrame의 E series의 결측치 값만 변경하고자 했으나 = 연산자 잘못 사용해서 E series제외하고 다 손실
# inplace의 속성으로 원본 데이터 수정
df['E'].fillna(4, inplace=True)
df

          A         B         C         D    E
0 -2.097587  0.327855  0.731306  0.396911  1.0
1  0.815759 -0.455035 -1.045917 -0.052317  2.0
2 -1.869786  0.901711  1.138790  0.909261  3.0
3  0.219533 -1.524360 -0.241029 -0.504755  4.0
4  1.980305 -0.831352 -0.080027  0.547338  5.0
5  0.584580  0.937914 -0.349093  1.212873  6.0

In [201]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   float     1 non-null      float64
 1   int       1 non-null      int64
 2   datetime  1 non-null      datetime64[ns]
 3   string    1 non-null      object
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [200]:
df = pd.DataFrame({'float': [1.0],
                   'int': [1],
                   'datetime': [pd.Timestamp('20180310')],
                   'string': ['foo']})
df.dtypes

float              float64
int                  int64
datetime    datetime64[ns]
string              object
dtype: object

In [216]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
print(df.dtypes)
print(df)

col1    int64
col2    int64
dtype: object
   col1  col2
0     1     3
1     2     4

In [217]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [226]:
df = df.astype('float64')
df

   col1  col2
0   1.0   3.0
1   2.0   4.0

In [227]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    2 non-null      float64
 1   col2    2 non-null      float64
dtypes: float64(2)
memory usage: 160.0 bytes

* 늘 고민거리 <br>
결측치가 포함된 데이터 series 타입은 숫자가 아닌 타입으로 적용했는지? <br>
해결책 1 - 결측치 값 대체 <br>
            : 0으로? 평균? 중앙값? 빈도수가 높은 데이터(최빈값?)
해결책 2 - 타입 변경<br>
            : 변경 가능한 타입으로 변경

## **외부 파일로 DataFrame 생성 및 관리**

In [250]:
df = pd.read_csv("0.dataSet/friends.csv")
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [233]:
# 이름 series만 slicing

df['이름']

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: 이름, dtype: object

In [238]:
# 이영자만 slicing

df.loc[3, '이름']

'이영자'

In [251]:
df.loc[3, '이름'] = '정찬우'
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  정찬우  45  상담사   talk
4  강호동  38  연예인   talk

In [246]:
df = pd.read_table("0.dataSet/friendsTab.txt")
print(type(df))
print(df)
df

<class 'pandas.core.frame.DataFrame'>
    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [253]:
df = pd.read_table("0.dataSet/friendsTabNoHead.txt")
print(type(df))
print(df)
df

<class 'pandas.core.frame.DataFrame'>
   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [256]:
# 컬럼명(series명) 추가해서 데이터 보존 작업 시도중

# step01 - 데이터 손실
df.columns = ["name", "age", "job", "hobby" ]
df

  name  age  job  hobby
0  유재석   41   교수    art
1  김새롬   18   학생  study
2  이영자   45  상담사   talk
3  강호동   38  연예인   talk

In [263]:
# step02 - file 내용 read시에 header 정보 설정해서 데이터 손실 방지
# header=None 필수
df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t", header=None, names=["name", "age", "job", "hobby"])
print(type(df))
print(df)
df

<class 'pandas.core.frame.DataFrame'>
  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [258]:
# step03 컬럼 추가
# 기존 설정을 변경 

df.columns = ["name", "age", "job", "hobby" ]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [265]:
# file로 read시에 컬럼명 명시하면서 read하는 문법
# 단, header가 없는 파일인 경우에 한해서

df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t", header=None, names=["name", "age", "job", "hobby"])
print(type(df))
print(df)
df

<class 'pandas.core.frame.DataFrame'>
  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [269]:
# series 추가하면서 모든 row에 동일한 데이터 저장
df['salary']=0
df

  name  age  job  hobby  salary
0  신동엽   20  연예인  music       0
1  유재석   41   교수    art       0
2  김새롬   18   학생  study       0
3  이영자   45  상담사   talk       0
4  강호동   38  연예인   talk       0

**삼항 연산자**
1. 조건식?true인경우 실행 : false인 경우 실행
2. where()은 일반 프로그램의 삼항ㄹ 연산자와 흡사

In [270]:
a = np.arange(10)
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [271]:
np.where(a < 5, a, 10*a)

array([ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90])

In [273]:
df['job']

0    연예인
1     교수
2     학생
3    상담사
4    연예인
Name: job, dtype: object

In [274]:
print(df['job'] != '학생')

0     True
1     True
2    False
3     True
4     True
Name: job, dtype: bool

In [283]:
#? job이 학생인 경우 salary 값이 no, 학생이 아닌경우엔 yes로 where 함수로 적용

df['salary'] = np.where(df['job'] != '학생', "yes", "no")
df

  name  age  job  hobby salary
0  신동엽   20  연예인  music    yes
1  유재석   41   교수    art    yes
2  김새롬   18   학생  study     no
3  이영자   45  상담사   talk    yes
4  강호동   38  연예인   talk    yes

In [284]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'}]
type(friend_dict_list)

list

In [285]:
friend_dict_list

[{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
 {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
 {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
 {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
 {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]

In [287]:
print(friend_dict_list[0])
print(friend_dict_list[0]['name'])

{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}
신동엽

In [289]:
# list로 DataFrame 객체 생성
df = pd.DataFrame(friend_dict_list)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [290]:
# 컬럼 순서 변경
# 컬럼의 header명을 list로 구성해서 df의 적용
df =df[['hobby', 'age', 'name', 'job']]
df

   hobby  age name  job
0  music   20  신동엽  연예인
1    art   41  유재석   교수
2  study   18  김새롬   학생
3   talk   45  이영자  상담사
4   talk   38  강호동  연예인

## row 자체에 중복 데이터 적용해서 새로운 데이터셋 구성 
1. 동일한 row가 존재할 경우 중복 제거
2. age값만 다른 경우 중복이 아닌 경우의 처리

In [306]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'}]
type(friend_dict_list)
df = pd.DataFrame(friend_dict_list);
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [292]:
# 중복여부확인
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [295]:
# 중복된 데이터의 마지막 row는 유지하는 속성
df = df.drop_duplicates(keep='last')
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [304]:
df.iloc[1,0] = '신동엽'
df

  name  age  job  hobby
1  유재석   41   교수    art
2  신동엽   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [307]:
# loc 위치 검색 속성으로 데이터 확인 가능
# 값 대입시에는 문법오류 = iloc로 
df.loc[:,'name']

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
5    신동엽
Name: name, dtype: object

In [45]:
# 이름을 기준으로 중복 이름 제거 
df.drop_duplicates('name', keep='last', inplace=True)
df

<ipython-input-45-ade121f867d4>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop_duplicates('name', keep='last', inplace=True)

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

**결측치 제거**

1. 결측치를 의미하는 키워드 - None/na/null/nan

In [46]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'}]

df = pd.DataFrame(friend_dict_list);
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [48]:
# 결측치 확인 함수
df.isna()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [49]:
df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [50]:
df['age']

0    20.0
1    41.0
2    18.0
3    45.0
4    38.0
5     NaN
Name: age, dtype: float64

**참고**

1. DB의 count()/sum()/max().. row들의 특정 데이터값을 연산후에 하나의 결과값으로 반환하는 집계/그룹함수
2. 특징 : null값은 내부적으로 철저하게 제거 하고 계산

In [53]:
print(df['age'].sum())
print(df['age'].mean())  # 결측치는 제거 후 counting 해서 평균 연산

162.0
32.4

In [54]:
162.0 / 32.4

5.0

In [55]:
# 결측값들을 대체 

df['age'].fillna(0, inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   0.0  연예인  music